springboot230/load_test_result.txt
./load_test.sh
ENDPOINT: http://127.0.0.1:8080/helloWorld
==> Simple request
HTTP/1.1 200
Connection: keep-alive
Content-Length: 11
Content-Type: text/plain;charset=UTF-8
Date: Fri, 22 May 2020 05:41:14 GMT
Keep-Alive: timeout=60

Request # 1

==> First load

Summary:
  Total:    5.6593 secs
  Slowest:  0.2311 secs
  Fastest:  0.0002 secs
  Average:  0.0056 secs
  Requests/sec: 17670.0952

  Total data:   1488900 bytes
  Size/request: 14 bytes

Response time histogram:
  0.000 [1] |
  0.023 [97934] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.046 [1422]  |■
  0.069 [336]   |
  0.093 [171]   |
  0.116 [103]   |
  0.139 [16]    |
  0.162 [6] |
  0.185 [6] |
  0.208 [3] |
  0.231 [2] |


Latency distribution:
  10% in 0.0011 secs
  25% in 0.0027 secs
  50% in 0.0039 secs
  75% in 0.0062 secs
  90% in 0.0100 secs
  95% in 0.0137 secs
  99% in 0.0358 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0002 secs, 0.2311 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0195 secs
  resp wait:    0.0053 secs, 0.0001 secs, 0.2310 secs
  resp read:    0.0002 secs, 0.0000 secs, 0.0149 secs

Status code distribution:
  [200] 100000 responses



==> Second request

Summary:
  Total:    2.4151 secs
  Slowest:  0.0570 secs
  Fastest:  0.0001 secs
  Average:  0.0024 secs
  Requests/sec: 41406.1530

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.006 [99007] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.012 [797]   |
  0.017 [176]   |
  0.023 [13]    |
  0.029 [1] |
  0.034 [2] |
  0.040 [0] |
  0.046 [1] |
  0.051 [1] |
  0.057 [1] |


Latency distribution:
  10% in 0.0012 secs
  25% in 0.0017 secs
  50% in 0.0023 secs
  75% in 0.0029 secs
  90% in 0.0036 secs
  95% in 0.0042 secs
  99% in 0.0058 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0570 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0044 secs
  resp wait:    0.0020 secs, 0.0001 secs, 0.0549 secs
  resp read:    0.0002 secs, 0.0000 secs, 0.0080 secs

Status code distribution:
  [200] 100000 responses



==> Third request

Summary:
  Total:    1.9376 secs
  Slowest:  0.0170 secs
  Fastest:  0.0001 secs
  Average:  0.0019 secs
  Requests/sec: 51609.4605

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.002 [53107] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [38974] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [6373]  |■■■■■
  0.007 [1040]  |■
  0.009 [135]   |
  0.010 [73]    |
  0.012 [96]    |
  0.014 [153]   |
  0.015 [33]    |
  0.017 [15]    |


Latency distribution:
  10% in 0.0007 secs
  25% in 0.0012 secs
  50% in 0.0017 secs
  75% in 0.0024 secs
  90% in 0.0033 secs
  95% in 0.0039 secs
  99% in 0.0057 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0170 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0038 secs
  resp wait:    0.0013 secs, 0.0001 secs, 0.0149 secs
  resp read:    0.0004 secs, 0.0000 secs, 0.0085 secs

Status code distribution:
  [200] 100000 responses



==> hit it for 30s
Running 30s test @ http://127.0.0.1:8080/helloWorld
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.34ms   11.87ms 226.14ms   98.74%
    Req/Sec     7.29k     1.48k   21.85k    91.91%
  1621900 requests in 30.11s, 202.25MB read
Requests/sec:  53873.26
Transfer/sec:      6.72MB
==> Last simple request
HTTP/1.1 200
Connection: keep-alive
Content-Length: 17
Content-Type: text/plain;charset=UTF-8
Date: Fri, 22 May 2020 05:42:25 GMT
Keep-Alive: timeout=60

Request # 1921902

Total time in seconds: 71